driver-tests/bpelse/flow/FlowJbi/test/FlowRepeatUntil18/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:flow="http://j2ee.netbeans.org/wsdl/FlowRepeatUntil">
  <soapenv:Body>
    <flow:branch1>Flow RepeatUntil 1</flow:branch1>
    <flow:branch2>Flow RepeatUntil 2</flow:branch2>
    <flow:counter>1</flow:counter>
  </soapenv:Body>
</soapenv:Envelope>